# IFC_ImportWithUI

## Description
Imports IFC file using the IFC Import dialog.

```pascal
PROCEDURE IFC_ImportWithUI;
```

```python
def vs.IFC_ImportWithUI():
    return None
```

## Examples
#### VectorScript ####
```pascal
PROCEDURE Test;

BEGIN
	ok := IFC_ImportWithUI();
END;

RUN(Test);
```
#### Python ####
```python
ok = vs.IFC_ImportWithUI()
```

```pascal
IFC_ImportWithUI;
```
```python
import vs

# Imports IFC file using the IFC Import dialog.
vs.IFC_ImportWithUI()
```

## Version
Availability: from Vectorworks 2014

## Category
* IFC